#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=247cc2ff69516b35c8acc679292eca44f7c3f0c7]
data.aws_caller_identity.current: Reading...
aws_sns_topic.alarm_topic: Refreshing state... [id=arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm]
data.aws_caller_identity.current: Read complete after 0s [id=505394176116]
aws_sns_topic_subscription.email_subscription: Refreshing state... [id=arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm:ec429d0d-d2f1-4cf6-a4ff-53ad1b0cffb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/publish-power-consumption-to-ha-prod-run"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.log_filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "log_filter" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "[ERROR]"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/publish-power-consumption-to-ha-prod-run"
      + name            = "error-filter"
      + role_arn        = (known after apply)
    }

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "error-parsing-prod-eu-west-3-lambdaRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.cloudwatch_logs will be created
  + resource "aws_iam_role_policy" "cloudwatch_logs" {
      + id          = (known after apply)
      + name        = "error-parsing-cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:TagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:eu-west-3:505394176116:log-group:/aws/lambda/error-parsing-prod*:*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:eu-west-3:505394176116:log-group:/aws/lambda/error-parsing-prod*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.sns will be created
  + resource "aws_iam_role_policy" "sns" {
      + id          = (known after apply)
      + name        = "error-parsing-sns"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_function.error_parsing will be created
  + resource "aws_lambda_function" "error_parsing" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Parses errors and sends to SNS topic."
      + filename                       = "./handler.zip"
      + function_name                  = "error-parsing-prod-publish"
      + handler                        = "handler.run"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Ioq3Fud6qKLWOttIybyDsV0SmBaMz7TJc9Bmsy+CQHI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + tags_all                       = {
          + "Environment"          = "prod"
          + "Product"              = "error-parsing"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/error-parsing"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_LEVEL" = "DEBUG"
              + "SNS_ARN"   = "arn:aws:sns:eu-west-3:505394176116:error-parsing-alerts-alarm"
            }
        }
    }

  # aws_lambda_permission.cloudwatch_logs will be created
  + resource "aws_lambda_permission" "cloudwatch_logs" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "error-parsing-prod-publish"
      + id                  = (known after apply)
      + principal           = "logs.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "./terraform.plan"

```

</details>

*Pushed by: @aribasadme, Action: `pull_request`*